export default {
      tile: `Ts代码生成在线文档`,
      docs: `<h1>Ts代码生成在线文档</h1>
<div class="card"><h3 id="%E4%BB%8B%E7%BB%8D"><svg viewBox="0 0 1024 1024"  width="14" height="14"><path d="M491.054545 779.636364l-125.672727 125.672727c-32.581818 32.581818-76.8 51.2-123.345454 51.2s-90.763636-18.618182-123.345455-51.2c-67.490909-67.490909-67.490909-179.2 0-246.690909l223.418182-223.418182c32.581818-32.581818 76.8-51.2 123.345454-51.2s90.763636 18.618182 123.345455 51.2c13.963636 13.963636 34.909091 13.963636 46.545455 0 13.963636-13.963636 13.963636-34.909091 0-46.545455-93.090909-93.090909-246.690909-93.090909-342.109091 0L69.818182 612.072727c-46.545455 46.545455-69.818182 107.054545-69.818182 169.890909C0 847.127273 25.6 907.636364 69.818182 954.181818c46.545455 46.545455 109.381818 69.818182 169.890909 69.818182 62.836364 0 123.345455-23.272727 169.890909-69.818182l125.672727-125.672727c13.963636-13.963636 13.963636-34.909091 0-46.545455-9.309091-16.290909-30.254545-16.290909-44.218182-2.327272z" p-id="2808"></path><path d="M954.181818 69.818182c-93.090909-93.090909-246.690909-93.090909-342.109091 0l-125.672727 125.672727c-13.963636 13.963636-13.963636 34.909091 0 46.545455 13.963636 13.963636 34.909091 13.963636 46.545455 0L658.618182 116.363636c32.581818-32.581818 76.8-51.2 123.345454-51.2s90.763636 18.618182 123.345455 51.2c67.490909 67.490909 67.490909 179.2 0 246.690909l-223.418182 223.418182c-32.581818 32.581818-76.8 51.2-123.345454 51.2s-90.763636-18.618182-123.345455-51.2c-13.963636-13.963636-34.909091-13.963636-46.545455 0-13.963636 13.963636-13.963636 34.909091 0 46.545455 46.545455 46.545455 109.381818 69.818182 169.89091 69.818182 62.836364 0 123.345455-23.272727 169.890909-69.818182l223.418181-223.418182c46.545455-46.545455 69.818182-107.054545 69.818182-169.890909C1024 176.872727 998.4 116.363636 954.181818 69.818182z" p-id="2809"></path></svg>介绍</h3>
<p>提供命令行根据本地的 ts 类型生成在线 API 文档</p>
<p>本地环境打包</p>
<div class="code-box-max">
<div class="copy-code-btn"></div>
<pre><code class="language-bash">api-see watch --path src/action/typings --server <span class="hljs-literal">true</span>
</code></pre>
</div>
<p>测试环境打包</p>
<div class="code-box-max">
<div class="copy-code-btn"></div>
<pre><code class="language-bash">api-see build --path src/action/typings
</code></pre>
</div>
</div><div class="card"><h3 id="ts%20%E4%BB%A3%E7%A0%81%E8%A7%84%E8%8C%83"><svg viewBox="0 0 1024 1024"  width="14" height="14"><path d="M491.054545 779.636364l-125.672727 125.672727c-32.581818 32.581818-76.8 51.2-123.345454 51.2s-90.763636-18.618182-123.345455-51.2c-67.490909-67.490909-67.490909-179.2 0-246.690909l223.418182-223.418182c32.581818-32.581818 76.8-51.2 123.345454-51.2s90.763636 18.618182 123.345455 51.2c13.963636 13.963636 34.909091 13.963636 46.545455 0 13.963636-13.963636 13.963636-34.909091 0-46.545455-93.090909-93.090909-246.690909-93.090909-342.109091 0L69.818182 612.072727c-46.545455 46.545455-69.818182 107.054545-69.818182 169.890909C0 847.127273 25.6 907.636364 69.818182 954.181818c46.545455 46.545455 109.381818 69.818182 169.890909 69.818182 62.836364 0 123.345455-23.272727 169.890909-69.818182l125.672727-125.672727c13.963636-13.963636 13.963636-34.909091 0-46.545455-9.309091-16.290909-30.254545-16.290909-44.218182-2.327272z" p-id="2808"></path><path d="M954.181818 69.818182c-93.090909-93.090909-246.690909-93.090909-342.109091 0l-125.672727 125.672727c-13.963636 13.963636-13.963636 34.909091 0 46.545455 13.963636 13.963636 34.909091 13.963636 46.545455 0L658.618182 116.363636c32.581818-32.581818 76.8-51.2 123.345454-51.2s90.763636 18.618182 123.345455 51.2c67.490909 67.490909 67.490909 179.2 0 246.690909l-223.418182 223.418182c-32.581818 32.581818-76.8 51.2-123.345454 51.2s-90.763636-18.618182-123.345455-51.2c-13.963636-13.963636-34.909091-13.963636-46.545455 0-13.963636 13.963636-13.963636 34.909091 0 46.545455 46.545455 46.545455 109.381818 69.818182 169.89091 69.818182 62.836364 0 123.345455-23.272727 169.890909-69.818182l223.418181-223.418182c46.545455-46.545455 69.818182-107.054545 69.818182-169.890909C1024 176.872727 998.4 116.363636 954.181818 69.818182z" p-id="2809"></path></svg>ts 代码规范</h3>
<div class="code-box-max">
<div class="copy-code-btn"></div>
<pre><code class="language-typescript"><span class="hljs-comment">/**
 * 获取用户列表信息
 * <span class="hljs-doctag">@url</span> /z/common/user/list
 * <span class="hljs-doctag">@introduce</span> 这是请求所有用户数据的接口
 * <span class="hljs-doctag">@method</span> <span class="hljs-variable">GET</span>
 */</span>
<span class="hljs-keyword">export</span> <span class="hljs-keyword">type</span> userInfo = {
  <span class="hljs-attr">request</span>: {
    <span class="hljs-comment">/**
     * <span class="hljs-doctag">@description</span> 每页数据数量
     **/</span>
    <span class="hljs-attr">pageSize</span>: <span class="hljs-built_in">number</span>;
    <span class="hljs-comment">/**
     * <span class="hljs-doctag">@description</span> 第几页
     **/</span>
    <span class="hljs-attr">pageNum</span>: <span class="hljs-built_in">number</span>;
  };
  <span class="hljs-attr">response</span>: {
    <span class="hljs-comment">/**
     * <span class="hljs-doctag">@description</span> 成功
     **/</span>
    <span class="hljs-attr">success</span>: <span class="hljs-built_in">boolean</span>;
    <span class="hljs-attr">data</span>: {
      <span class="hljs-comment">/**
       * <span class="hljs-doctag">@description</span> 用户总数
       **/</span>
      <span class="hljs-attr">total</span>: <span class="hljs-built_in">number</span>;
      <span class="hljs-comment">/**
       * <span class="hljs-doctag">@description</span> 用户列表
       **/</span>
      <span class="hljs-attr">list</span>: {
        <span class="hljs-comment">/**
         * <span class="hljs-doctag">@description</span> 用户拥有的角色
         **/</span>
        <span class="hljs-attr">roles</span>: <span class="hljs-built_in">string</span>[];
        <span class="hljs-comment">/**
         * <span class="hljs-doctag">@description</span> 用户名称
         **/</span>
        <span class="hljs-attr">userName</span>: <span class="hljs-built_in">string</span>;
      }[];
    };
  };
};
</code></pre>
</div>
</div><div class="card"><h3 id="%E7%9B%B8%E5%85%B3%E9%85%8D%E7%BD%AE"><svg viewBox="0 0 1024 1024"  width="14" height="14"><path d="M491.054545 779.636364l-125.672727 125.672727c-32.581818 32.581818-76.8 51.2-123.345454 51.2s-90.763636-18.618182-123.345455-51.2c-67.490909-67.490909-67.490909-179.2 0-246.690909l223.418182-223.418182c32.581818-32.581818 76.8-51.2 123.345454-51.2s90.763636 18.618182 123.345455 51.2c13.963636 13.963636 34.909091 13.963636 46.545455 0 13.963636-13.963636 13.963636-34.909091 0-46.545455-93.090909-93.090909-246.690909-93.090909-342.109091 0L69.818182 612.072727c-46.545455 46.545455-69.818182 107.054545-69.818182 169.890909C0 847.127273 25.6 907.636364 69.818182 954.181818c46.545455 46.545455 109.381818 69.818182 169.890909 69.818182 62.836364 0 123.345455-23.272727 169.890909-69.818182l125.672727-125.672727c13.963636-13.963636 13.963636-34.909091 0-46.545455-9.309091-16.290909-30.254545-16.290909-44.218182-2.327272z" p-id="2808"></path><path d="M954.181818 69.818182c-93.090909-93.090909-246.690909-93.090909-342.109091 0l-125.672727 125.672727c-13.963636 13.963636-13.963636 34.909091 0 46.545455 13.963636 13.963636 34.909091 13.963636 46.545455 0L658.618182 116.363636c32.581818-32.581818 76.8-51.2 123.345454-51.2s90.763636 18.618182 123.345455 51.2c67.490909 67.490909 67.490909 179.2 0 246.690909l-223.418182 223.418182c-32.581818 32.581818-76.8 51.2-123.345454 51.2s-90.763636-18.618182-123.345455-51.2c-13.963636-13.963636-34.909091-13.963636-46.545455 0-13.963636 13.963636-13.963636 34.909091 0 46.545455 46.545455 46.545455 109.381818 69.818182 169.89091 69.818182 62.836364 0 123.345455-23.272727 169.890909-69.818182l223.418181-223.418182c46.545455-46.545455 69.818182-107.054545 69.818182-169.890909C1024 176.872727 998.4 116.363636 954.181818 69.818182z" p-id="2809"></path></svg>相关配置</h3>
<p>配置文件根目录下 api.config.(ts)js 文件</p>
<table>
<thead>
<tr>
<th>字段</th>
<th>描述</th>
<th>类型</th>
<th>默认值</th>
</tr>
</thead>
<tbody>
<tr>
<td>path</td>
<td>请求字段类型所在的文件路径::::_QA</td>
<td><em>string</em></td>
<td>&quot;./src/actions/types&quot;</td>
</tr>
<tr>
<td>buildPath</td>
<td>接口文档打包路径</td>
<td><em>string</em></td>
<td>&quot;./api-ui&quot;</td>
</tr>
<tr>
<td>buildPort</td>
<td>接口文档开发环境服务端口</td>
<td><em>number</em></td>
<td>7878</td>
</tr>
</tbody>
</table>
</div><div class="card"><h3 id="%E5%B0%86%E6%96%87%E6%A1%A3%20UI%20%E5%BA%94%E7%94%A8%E5%88%B0%E6%B5%8B%E8%AF%95%E7%8E%AF%E5%A2%83"><svg viewBox="0 0 1024 1024"  width="14" height="14"><path d="M491.054545 779.636364l-125.672727 125.672727c-32.581818 32.581818-76.8 51.2-123.345454 51.2s-90.763636-18.618182-123.345455-51.2c-67.490909-67.490909-67.490909-179.2 0-246.690909l223.418182-223.418182c32.581818-32.581818 76.8-51.2 123.345454-51.2s90.763636 18.618182 123.345455 51.2c13.963636 13.963636 34.909091 13.963636 46.545455 0 13.963636-13.963636 13.963636-34.909091 0-46.545455-93.090909-93.090909-246.690909-93.090909-342.109091 0L69.818182 612.072727c-46.545455 46.545455-69.818182 107.054545-69.818182 169.890909C0 847.127273 25.6 907.636364 69.818182 954.181818c46.545455 46.545455 109.381818 69.818182 169.890909 69.818182 62.836364 0 123.345455-23.272727 169.890909-69.818182l125.672727-125.672727c13.963636-13.963636 13.963636-34.909091 0-46.545455-9.309091-16.290909-30.254545-16.290909-44.218182-2.327272z" p-id="2808"></path><path d="M954.181818 69.818182c-93.090909-93.090909-246.690909-93.090909-342.109091 0l-125.672727 125.672727c-13.963636 13.963636-13.963636 34.909091 0 46.545455 13.963636 13.963636 34.909091 13.963636 46.545455 0L658.618182 116.363636c32.581818-32.581818 76.8-51.2 123.345454-51.2s90.763636 18.618182 123.345455 51.2c67.490909 67.490909 67.490909 179.2 0 246.690909l-223.418182 223.418182c-32.581818 32.581818-76.8 51.2-123.345454 51.2s-90.763636-18.618182-123.345455-51.2c-13.963636-13.963636-34.909091-13.963636-46.545455 0-13.963636 13.963636-13.963636 34.909091 0 46.545455 46.545455 46.545455 109.381818 69.818182 169.89091 69.818182 62.836364 0 123.345455-23.272727 169.890909-69.818182l223.418181-223.418182c46.545455-46.545455 69.818182-107.054545 69.818182-169.890909C1024 176.872727 998.4 116.363636 954.181818 69.818182z" p-id="2809"></path></svg>将文档 UI 应用到测试环境</h3>
<p>开发环境只需要开启 <code>api-see watch --path ./src/actions/types --mock true --action true</code>
正式打包则使用 <code>api-see file</code>, 再执行本地项目的构建</p>
<div class="code-box-max">
<div class="copy-code-btn"></div>
<pre><code class="language-jsx"><span class="hljs-keyword">import</span> { <span class="hljs-title class_">ApiUi</span> } <span class="hljs-keyword">from</span> <span class="hljs-string">&quot;api-see&quot;</span>;
<span class="hljs-comment">// 默认当前项目生成接口文档数据，.gitignore文件加上 .cache</span>
<span class="hljs-keyword">import</span> apiData <span class="hljs-keyword">from</span> <span class="hljs-string">&quot;@/../.cache/api-ui-data.json&quot;</span>;
<span class="hljs-keyword">import</span> <span class="hljs-string">&quot;api-see/ui/app.less&quot;</span>;

<span class="hljs-keyword">export</span> <span class="hljs-keyword">default</span> <span class="hljs-keyword">function</span> <span class="hljs-title function_">Index</span>(<span class="hljs-params"></span>): <span class="hljs-title class_">React</span>.<span class="hljs-property">ReactNode</span> {
  <span class="hljs-keyword">return</span> <span class="language-xml"><span class="hljs-tag">&lt;<span class="hljs-name">ApiUi</span> <span class="hljs-attr">title</span>=<span class="hljs-string">&quot;crm接口文档&quot;</span> <span class="hljs-attr">mockPort</span>=<span class="hljs-string">{10998}</span> <span class="hljs-attr">apiData</span>=<span class="hljs-string">{apiData}</span> /&gt;</span></span>;
}
</code></pre>
</div>
<blockquote>
<p>由于api-ui-data是临时文件，注意屏蔽eslint错误</p>
</blockquote>
</div>`,
      h3Ids: `介绍:::ts 代码规范:::相关配置:::将文档 UI 应用到测试环境`,
      codePath: []
    }